results/580_driver/officail_vllm_FP8c16.txt
============ Serving Benchmark Result ============
Successful requests:                     30        
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  130.98    
Total input tokens:                      97924     
Total generated tokens:                  7680      
Request throughput (req/s):              0.23      
Output token throughput (tok/s):         58.64     
Peak output token throughput (tok/s):    176.00    
Peak concurrent requests:                19.00     
Total token throughput (tok/s):          806.29    
---------------Time to First Token----------------
Mean TTFT (ms):                          15462.13  
Median TTFT (ms):                        8305.98   
P99 TTFT (ms):                           43036.39  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          204.53    
Median TPOT (ms):                        230.91    
P99 TPOT (ms):                           247.18    
---------------Inter-token Latency----------------
Mean ITL (ms):                           203.86    
Median ITL (ms):                         102.87    
P99 ITL (ms):                            2057.95   
==================================================