results/580_driver/officail_vllm_FP8c20.txt
============ Serving Benchmark Result ============
Successful requests:                     30        
Failed requests:                         0         
Maximum request concurrency:             20        
Benchmark duration (s):                  134.42    
Total input tokens:                      97924     
Total generated tokens:                  7680      
Request throughput (req/s):              0.22      
Output token throughput (tok/s):         57.14     
Peak output token throughput (tok/s):    180.00    
Peak concurrent requests:                22.00     
Total token throughput (tok/s):          785.65    
---------------Time to First Token----------------
Mean TTFT (ms):                          18840.27  
Median TTFT (ms):                        11138.70  
P99 TTFT (ms):                           49790.73  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          243.09    
Median TPOT (ms):                        280.08    
P99 TPOT (ms):                           309.95    
---------------Inter-token Latency----------------
Mean ITL (ms):                           242.14    
Median ITL (ms):                         132.39    
P99 ITL (ms):                            2093.78   
==================================================